CRUD-CI4/app/Models/GradeModel.php

SELECT `grades`.*, `students`.`name` as `student_name`, `students`.`nis`, `subjects`.`subject_name`, `subjects`.`passing_grade`
FROM `grades`
JOIN `students` ON `students`.`id` = `grades`.`student_id`
JOIN `subjects` ON `subjects`.`id` = `grades`.`subject_id`
---
    public function getGradesWithDetails()
    {
        return $this->select('grades.*, students.name as student_name, students.nis, subjects.subject_name, subjects.passing_grade')
                    ->join('students', 'students.id = grades.student_id')
                    ->join('subjects', 'subjects.id = grades.subject_id')
                    ->findAll();