CRUD-CI4/app/Models/StudentModel.php

SELECT `students`.*, `classes`.`class_name`
FROM `students`
JOIN `classes` ON `classes`.`id` = `students`.`class_id`
---
    public function getStudentsWithClass()
    {
        return $this->select('students.*, classes.class_name')
                    ->join('classes', 'classes.id = students.class_id')
                    ->findAll();