CRUD-CI4/app/Controllers/Grades.php

SELECT *
FROM `students`
SELECT *
FROM `subjects`
---
    public function new()
    {
        $data = [
            'title'    => 'Input Nilai Siswa',
            'students' => $this->studentModel->findAll(),
            'subjects' => $this->subjectModel->findAll()

SELECT *
FROM `grades`
WHERE `grades`.`id` = '4'
SELECT *
FROM `students`
SELECT *
FROM `subjects`
---
    public function edit($id = null)
    {
        $data = [
            'title'    => 'Edit Nilai',
            'grade'    => $this->gradeModel->find($id),
            'students' => $this->studentModel->findAll(),
            'subjects' => $this->subjectModel->findAll()